#this saurce cord was written by hirusha keeth matheesha
#special thanks for hasindu theeckshana ,who get the run strings
#thank you
RUN_STRINGS = (
    "මම අවුරුදු පන්සියයකට ආසන්න කාලයක් ආහාරයට ගෙන නැත. ඇත්ත වශයෙන්ම මට අවශ්‍ය නැත, නමුත් යමෙකුට එය මග හැරේ. මම හිතන්නේ නැහැ මම මාව හඳුන්වා දුන්නා කියලා? ශ්‍රීමත් නිකලස් ඩි මිම්සි-පෝර්පිංටන් ඔබේ සේවයේ..ග්‍රිෆින්ඩෝර් කුළුණේ නේවාසික අවතාරය..",
    "ශ්‍රීමත් නිකලස් ඩි මිම්සි-පෝර්පිංටන්, ඔහුගේ මරණයෙන් පසු ආසන්න වශයෙන් හෙඩ්ලස් නික් ලෙස හැඳින්වේ. ඔහු වැඩිහිටියෙකු ලෙස රාජකීය මළුවෙහි මායාකරුවෙකි. ග්‍රීව් ආර්යාව සමඟ ඉන්ද්‍රජාලික අනතුරක් සිදු වූ පසු ඔහු දත් කෙළින් කිරීමට උත්සාහ කළ නමුත් එය පසුබෑමට ලක් වූ අතර ඇය ඇත් දළ වර්ධනය විය. එතැන් පටන් ඔහු හොග්වාර්ට්ස් කාසල් හි ග්‍රිෆින්ඩෝර් කුළුණේ නේවාසික අවතාරයක් බවට පත්විය",
    "පෝර්පින්ටන් මගේ ජීවිතයේ කිසි විටෙකත් බියගුලුකමට වරදකරුවෙකු වී නැති බව මම විශ්වාස කරමි! මගේ නහර තුළ දිවෙන උතුම් රුධිරය  මෙයට සාක්ෂි දරයි !!!",
    "පෝර්පින්ටන් මගේ ජීවිතයේ කිසි විටෙකත් බියගුලුකමට වරදකරුවෙකු වී නැති බව මම විශ්වාස කරමි! මගේ නහර තුළ දිවෙන උතුම් රුධිරය  මෙයට සාක්ෂි දරයි !!!",
    "පෝර්පින්ටන් මගේ ජීවිතයේ කිසි විටෙකත් බියගුලුකමට වරදකරුවෙකු වී නැති බව මම විශ්වාස කරමි! මගේ නහර තුළ දිවෙන උතුම් රුධිරය  මෙයට සාක්ෂි දරයි !!!",
    "❤"
    "මාගේ සම්පුර්න අයිතිය t.me/HogwartsPlus සතු වන අතර අනවසරෙන් ගෘෘප් වලට ඇතුලත් කිරිමෙන් ඇතුලත් කරන්නා මා විසින් gban කරනු ලැබේ",
    "මාගේ සම්පුර්න අයිතිය t.me/HogwartsPlus සතු වන අතර අනවසරෙන් ගෘෘප් වලට ඇතුලත් කිරිමෙන් ඇතුලත් කරන්නා මා විසින් gban කරනු ලැබේ",
)

INSULTS_STRINGS = (


    " OWW ... එවැනි මෝඩ මෝඩයෙක්.",
    " බොන්න එපා.",
    " මම හිතන්නේ ඔබ ගෙදර යා යුතුයි.",
    " විධානය හමු නොවීය. ඔබේ මොළය මෙන්.", 
    " ඔබ ඔබම මෝඩයෙකු බවට පත් කරන බව ඔබට වැටහෙනවාද? ",
    " ඔබට ඊට වඩා හොඳින් ටයිප් කළ හැකිය. ",
    " ඔබට ඊට වඩා හොඳ ටයිප් කළ හැකිය. ",
    " කණගාටුයි, අපි එසේ නොකරමු මොළය විකුණන්න.",
    " මාව විශ්වාස කරන්න ඔබ සාමාන්ය කෙනෙක් ලෙස විශ්වාස කරන්න. ",
    " ඔබ කිසි විටෙකත් එය භාවිතා කිරීමට ඔබේ මොළයට අලුත් යැයි හැඟේ. ",
    " මම එය කිසි විටෙකත් භාවිතා නොකරමි. මම ඔබේ ඊගෝවට නැඟී පනින්නෙමි ඔබේ IQ වෙත.",
    " Zombies මොළය අනුභව කරයි ...", "ඔබ ආරක්ෂිතයි.", "ඔබ වානරයන්ගෙන් පරිණාමය වී ඇත,",
    " ඔබේ IQ ඔබේ වයස ඉක්මවා යන විට මා සමඟ කතා කරන්න. ",
    " මම හිතන්නේ නැහැ, මම හිතන්නේ නැහැ, මම කියන්නේ,ඔබ කතා කරන විට ඔබට අවාසනාවන්ත වාසනාව ලැබී ඇති බවයි.",
    " ඔබ කතා කරන්නේ කුමන භාෂාවක්ද?", 
    " මෝඩකම ඔබට යාමට නිදහස නැත. ",
    " පරිණාමය නැවත ප්රතිලෝමව ගමන් කළ හැකි බවට ඔබ සාක්ෂියකි. ",
    " මම ඔබගෙන් වයස කීයදැයි ඔබෙන් අසමි නමුත් මම දන්නවා ඔබට එය ඉහළ මට්ටමක ගණන් කළ නොහැකි බව. ",
    " පිටස්තරයෙකු ලෙස, මිනිස් සංහතිය ගැන ඔබ සිතන්නේ කුමක්ද? ",
    " මොළ සියල්ලම සියල්ල නොවේ. ඔබේ නඩුවේ ඔවුන් කිසිවක් නැත. ",
    " සාමාන්යයෙන් මිනිසුන් ජීවත් වී ඉගෙන ගනී. ඔබ ජීවත් වෙති. ",
    " ඔබ මෙතරම් මෝඩ වන්නේ කුමක් දැයි මම නොදනිමි, නමුත් එය සැබවින්ම ක්රියාත්මක වේ. ",
    " දිගටම කතා කරන්න, කවදාහරි, කවදාහරි ඔබ බුද්ධිමත් දෙයක් කියනවා! ",
    " මාව කම්පනයට පත් කරන්න, බුද්ධිමත් දෙයක් කියන්න. ",
    " ඔබේ IQ ඔබේ සපත්තු ප්රමාණයට වඩා අඩු ",
    " අහෝ! ඔබේ ස්නායු සතොරති තවදුරටත් වැඩ කරන්නේ නැත. ",
    " ඔබට ඔබව මදක් ද? ",
    " ඔබට මෝඩ වීමට සෑම කෙනෙකුටම අයිතියක් ඇත. ",
    " මට ඇත්තෙන්ම කණගාටුයි, මම ඔබට මෝඩයා ලෙස හැඳින්වූ විට. මම හිතුවේ ඔයා දැනටමත් ඒක දැනගෙන හිටියා කියලා. ",
    " ඔබ සයනයිඩ් රස බැලීම උත්සාහ කළ යුතුයි. ",
    " ඔබ සදහටම නිදා ගැනීමට උත්සාහ කළ යුතුයි. ",
    " තුවක්කුවක් ගන්න, වෙඩි තබන්න ",
    " පැරෂුට් නොමැතිව ගුවන් යානයකින් පැනීමෙන් ඔබට ලෝක වාර්තාවක් තැබිය හැකිය. ",
    " Bs කතා කිරීම නවත්වන්න," 
    " දුවන වෙඩි උණ්ඩයක් ඉදිරිපිටට යන්න. ",
    " ජලය වෙනුවට හයිඩ්රොක්ලෝරික් අම්ලය සමඟ ස්නානය කරන්න. ",
    " මෙය උත්සාහ කරන්න: ඔබ ඔබේ හුස්ම දිය යට පැයක් යට තබාගෙන, එවිට ඔබට එය සදහටම අල්ලා ගත හැකිය. ",
    " හරිත වන්න! ඔක්සිජන් ආශ්වාස කිරීම නවත්වන්න. ",
    " දෙවි ඔබ ගැන සොයමින් සිටියේය. ඔබ ඔහුව හමුවීමට පිටවිය යුතුයි. ",
    " ඔබේ 100% දෙන්න. දැන්, යන්න ලේ පරිත්යාග කරන්න. ",
    " තට්ටු සියයකින් පැනීම උත්සාහ කරන්න, නමුත් ඔබට එය කළ හැක්කේ එක් වරක් පමණි. ",
    " ඔබ එය කිසි විටෙකත් භාවිතා නොකළ බව ඔබ තුළම පරිත්යාග කළ යුතුය. ",
    " ඔබ එය කිසි විටෙකත් භාවිතා නොකළ බව. ",
    " හිස වෙඩි තැබීම විනෝදජනකයි. ඔබම එකක් ලබා ගන්න. ",
    " ඔබ විශාල සුදු මෝරුන් සමඟ පිහිනීමට උත්සාහ කළ යුතුය. ",
    " ඔබ ඔබව රතු පැහැයෙන් පින්තාරු කළ යුතුය. ",
    " ඔබ නැවත ගවයා මැරතන් තරඟයක දුවන්න. ",
    " ඔබේ ජීවිතයේ ඉතිරි කාලය නැවත නැඟිට නොඑන්න. ", 
    " ඔබ දින 1 ක් මෙන් හුස්ම ගැනීම නතර කරන්නේ කෙසේද? එය විශිෂ්ටයි. ",
    " ඔබ දෙදෙනාම කූඩුවක සිටින විට කොටියෙකු කුපිත කිරීමට උත්සාහ කරන්න. ",
    " කැනනයකින් මීටර් 100 ක් තරම් ඉහළට වෙඩි තැබීමට ඔබ උත්සාහ කර තිබේද? ",
    " ඔබ ඔබේ මුඛය තුළ ගැට ගසා දැල්වීමට උත්සාහ කළ යුතුය එය.",
    " RDX වාදනය කිරීමට උත්සාහ කරන්න. ",
    " ෆෝසීන් විෂ සහිත බව මට ඇසුණි. ",
    " ඔබ එය විනෝදය සඳහා ආශ්වාස කරනවා. ",
    " ඔබ එය විනෝදය සඳහා ආශ්වාස කිරීම ගැන සිතන්න.",
)

SLAP_TEMPLATES = (
    "{user1} {hits} {user2} with a {item}.",
    "{user1} {hits} {user2} in the face with a {item}.",
    "{user1} {hits} {user2} around a bit with a {item}.",
    "{user1} {throws} a {item} at {user2}.",
    "{user1} grabs a {item} and {throws} it at {user2}'s face.",
    "{user1} launches a {item} in {user2}'s general direction.",
    "{user1} starts slapping {user2} silly with a {item}.",
    "{user1} pins {user2} down and repeatedly {hits} them with a {item}.",
    "{user1} grabs up a {item} and {hits} {user2} with it.",
    "{user1} ties {user2} to a chair and {throws} a {item} at them.",
    "{user1} gave a friendly push to help {user2} learn to swim in lava."
)

ITEMS = (
    "cast iron skillet",
    "large trout",
    "baseball bat",
    "cricket bat",
    "wooden cane",
    "nail",
    "printer",
    "shovel",
    "CRT monitor",
    "physics textbook",
    "toaster",
    "portrait of Richard Stallman",
    "television",
    "five ton truck",
    "roll of duct tape",
    "book",
    "laptop",
    "old television",
    "sack of rocks",
    "rainbow trout",
    "rubber chicken",
    "spiked bat",
    "fire extinguisher",
    "heavy rock",
    "chunk of dirt",
    "beehive",
    "piece of rotten meat",
    "bear",
    "ton of bricks",
)

THROW = (
    "throws",
    "flings",
    "chucks",
    "hurls",
)

HIT = (
    "hits",
    "whacks",
    "slaps",
    "smacks",
    "bashes",
)

MARKDOWN_HELP = """
Markdown is a very powerful formatting tool supported by telegram. {} has some enhancements, to make sure that \
saved messages are correctly parsed, and to allow you to create buttons.

- <code>_italic_</code>: wrapping text with '_' will produce italic text
- <code>*bold*</code>: wrapping text with '*' will produce bold text
- <code>`code`</code>: wrapping text with '`' will produce monospaced text, also known as 'code'
- <code>[sometext](someURL)</code>: this will create a link - the message will just show <code>sometext</code>, \
and tapping on it will open the page at <code>someURL</code>.
EG: <code>[test](example.com)</code>

- <code>[buttontext](buttonurl:someURL)</code>: this is a special enhancement to allow users to have telegram \
buttons in their markdown. <code>buttontext</code> will be what is displayed on the button, and <code>someurl</code> \
will be the url which is opened.
EG: <code>[This is a button](buttonurl:example.com)</code>

If you want multiple buttons on the same line, use :same, as such:
<code>[one](buttonurl://example.com)
[two](buttonurl://google.com:same)</code>
This will create two buttons on a single line, instead of one button per line.
"""

EnglishStrings = {
    "send-start": """හායි {}, මගේ නම {}! If you have any questions on how to use me, read /help - and then head to @YanaBotGroup.

හෝ... හෝ.... මන් තමයි ග්‍රිෆින්ඩෝ නේවාසික භූතයා [👻](https://telegra.ph/file/ba3c84393f9fb34f41ea1.jpg) .. ග්‍රිෆින්ඩෝවරුන් කියන්නේ සිංහයන්.. සිංහ පැටවුනේ.. ඔබ සමගින්ම සිටින මන් තමයි ශ්‍රීමත් නිකලස් .. සිංහ පෝතකයින්ට ජය වේවා !!!!
""",

    "send-help": """Hey there! My name is *{}*.
I'm a modular group management bot with a few fun extras! Have a look at the following for an idea of some of the things I can help you with.

Main commands available:
 - /start:ශ්‍රිමත් නිකලස් වන මාව start කරන්න
 - /help: ඉන්බොක්ස් විතරයි මගේ වැඩ ටික බලන්න ක්ලික් කරන්න.
 - /help <module name>: මගේ modules වල විස්තර දැනගන්න.
 - /donate: මේක නම් දුන්නැතත් අව්ලක් නැ බුතයොන්ට සල්ලි වැඩක් නැනේ🤣!
 - /lang: මම ශට් භාෂා පරමේශ්වර කෙනෙක් මම මොන භාෂාවෙන්ද කතා කරන්න ඕනෙ
 - /settings:
   - in PM: මම මගේ ඔක්කොම modules වල සෙටින් ඉන්බොක්ස් හරහා දාම්නම්.
   - in a group: .ගෘප් එකේ සෙටින් ඉන්බොක්ස් හරහා හදන්න පුලුවන්
   {}
   """,

    "send-group-settings": """Hi there! There are quite a few settings for *{}* - go ahead and pick what
you're interested in.""",

#Misc
"RUNS-K": RUN_STRINGS,
"SLAP_TEMPLATES-K": SLAP_TEMPLATES,
"ITEMS-K": ITEMS,
"HIT-K": HIT,
"THROW-K": THROW,
"ITEMP-K": ITEMS,
"ITEMR-K": ITEMS,
"MARKDOWN_HELP-K": MARKDOWN_HELP,
"INSULTS-K": INSULTS_STRINGS,

#GDPR
"send-gdpr": """Your personal data has been deleted.\n\nNote that this will not unban \
you from any chats, as that is telegram data, not YanaBot data.
Flooding, warns, and gbans are also preserved, as of \
[this](https://ico.org.uk/for-organisations/guide-to-the-general-data-protection-regulation-gdpr/individual-rights/right-to-erasure/), "
which clearly states that the right to erasure does not apply \
\"for the performance of a task carried out in the public interest\", as is \
the case for the aforementioned pieces of data."""

}
